OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Audio_Headset/USB/descriptors_20.c
/******************************************************************************
 * @file     descriptors.c
 * @brief    NuMicro series USBD driver source file
 * @date     2017/04/26 09:30 a.m.
 *
 * @note
 * Copyright (C) 2017 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
/*!<Includes */
#include "NUC505Series.h"
#include "AudioLib.h"
#include "usbd_audio_20.h"

/*
  *Microphone / *Speaker - Interface alternate 1~2
  +-----------+------------+----------------+
  | Alternate | Channel(s) | Bit Resolution | 
  +-----------+------------+----------------+
  |     1     |      2     |     16 bits    |
  +-----------+------------+----------------+
  |     2     |      2     |     24 bits    |
  +-----------+------------+----------------+

  Note:
  1.If you want to remove certain alternate for Microphone or Speaker interface, please remove the group of 
    the alternate descriptors (Standard AC Interface Descriptor, Class-Specific AS Interface Descriptor Descriptor, 
    Audio Format Type Descriptor, Standard AS Isochronous Feedback Endpoint Descriptor, Class-Specific AS 
    Isochronous Audio Data Endpoint Descriptor) and modify the Total Length field of Configuration Descriptor.
    For example,
      Remove  Microphone Interface alternate 2 (24 bit resolution) from Speaker & Microphone descriptor with HID  
    
      1.Remove the following descriptors for Microphone - Interface alternate 2
         Microphone - Interface alternate 2
           Standard AC Interface Descriptor                             (0x09)
           Class-Specific AS Interface Descriptor                       (0x10)
           Audio Format Type Descriptor                                 (0x06)
           Standard AS Isochronous Feedback Endpoint Descriptor         (0x07)
           Class-Specific AS Isochronous Audio Data Endpoint Descriptor (0x08)
           *Interface alternate Summary                                 (0x2E)                              
           
      2.Modify the Total Length field of Configuration Descriptor to 0x14C.
         
         0x17A(Original Total Length) - 0x2E(Total Length of descriptors for Microphone - Interface alternate 2) = 0x14C       
    
      3.Modify the change for interface alternate in UAC_SetInterface_20.c
      
  2.If you want to add / remove sampling rate, please modify sampling rate array (Speedx) in UAC_ClassRequest_20.c
    
  3.If you want to change the support function of audio control, please modify the bmaControls field of
    Audio Control Feature Unit Descriptor for Microphone or Speaker
      A bit set to 1 indicates that the mentioned Control is supported
         D3..2: Volume Control
         D5..4: Bass Control
         D7..6: Mid Control
         D9..8: Treble Control
         D11..10: Graphic Equalizer Control
         D13..12: Automatic Gain Control
         D15..14: Delay Control
         D17..16: Bass Control
         D19..18: Loudness Control
         D21..20: Input Gain Control
         D23..22: Input Gain Pad Control
         D25..24: Phase Inverter Control
         D27..26: Underflow Control
         D29..28: Overflow Control
         D31..30: Reserved, should set to 0  
         
  4.If you want to change the polling interal of HID Endpoint, please modify the bInterval field of Endpoint Descriptor for HID.
*/

/*----------------------------------------------------------------------------*/
/*!<USB HID Report Descriptor */
#ifdef __HID20__
#ifdef __KEYBOARD20__
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8KeyboardReportDesc_20[] =
#else
uint8_t gu8KeyboardReportDesc_20[] __attribute__((aligned(4))) =
#endif
{
    0x05, 0x01,        /* Usage Page(Generic Desktop Controls) */
    0x09, 0x06,        /* Usage(Keyboard) */
    0xA1, 0x01,        /* Collection(Application) */
    0x05, 0x07,        /* Usage Page(Keyboard/Keypad) */
    0x19, 0xE0,        /* Usage Minimum(0xE0) */
    0x29, 0xE7,        /* Usage Maximum(0xE7) */ 
    0x15, 0x00,        /* Logical Minimum(0x0) */
    0x25, 0x01,        /* Logical Maximum(0x1) */
    0x75, 0x01,        /* Report Size(0x1) */
    0x95, 0x08,        /* Report Count(0x8) */
    0x81, 0x02,        /* Input(Data, Variable, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0x95, 0x01,        /* Report Count(0x1) */
    0x75, 0x08,        /* Report Size(0x8) */
    0x81, 0x01,        /* Input(Constant, Array, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0x95, 0x05,        /* Report Count(0x5) */
    0x75, 0x01,        /* Report Size(0x1) */
    0x05, 0x08,        /* Usage Page(LEDs) */
    0x19, 0x01,        /* Usage Minimum(0x1) */
    0x29, 0x05,        /* Usage Maximum(0x5) */ 
    0x91, 0x02,        /* Output(Data, Variable, Absolute, No Wrap, Linear, Preferred State, No Null Position, Non VolatileBit Field) */
    0x95, 0x01,        /* Report Count(0x1) */
    0x75, 0x03,        /* Report Size(0x3) */ 
    0x91, 0x01,        /* Output(Constant, Array, Absolute, No Wrap, Linear, Preferred State, No Null Position, Non VolatileBit Field) */
    0x95, 0x06,        /* Report Count(0x6) */
    0x75, 0x08,        /* Report Size(0x8) */ 
    0x15, 0x00,        /* Logical Minimum(0x0) */
    0x25, 0x65,        /* Logical Maximum(0x65) */ 
    0x05, 0x07,        /* Usage Page(Keyboard/Keypad) */
    0x19, 0x00,        /* Usage Minimum(0x0) */
    0x29, 0x65,        /* Usage Maximum(0x65) */
    0x81, 0x00,        /* Input(Data, Array, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0xC0               /* End Collection */ 
};

#elif defined __MEDIAKEY20__
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8KeyboardReportDesc_20[] =
#else
uint8_t gu8KeyboardReportDesc_20[] __attribute__((aligned(4))) =
#endif
{
    /* Media key */   
    0x05, 0x0C,        /* Usage Page (Consumer) */
    0x09, 0x01,        /* Usage(Consumer Control) */
    0xA1, 0x01,        /* Collection(Application) */
    0x15, 0x00,        /* Logical Minimum(0x0) */
    0x25, 0x01,        /* Logical Maximum(0x1) */
    0x09, 0xE2,        /* Usage(Mute) */
    0x09, 0xE9,        /* Usage(Volume Increment) */
    0x09, 0xEA,        /* Usage(Volume Decrement) */
    0x75, 0x01,        /* Report Size(0x1) */
    0x95, 0x03,        /* Report Count(0x3) */
    0x81, 0x02,        /* Input(Data, Variable, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0x75, 0x01,        /* Report Size(0x1) */
    0x95, 0x05,        /* Report Count(0x5) */
    0x81, 0x03,        /* Input(Constant, Variable, Absolute) */
    0x09, 0xB0,        /* Usage(Play) */
    0x09, 0xB7,        /* Usage(Stop) */
    0x09, 0xCD,        /* Usage(Play/Pause) */
    0x09, 0xB5,        /* Usage(Scan Next Track) */
    0x09, 0xB6,        /* Usage(Scan Previous Track) */
    0x09, 0xB2,        /* Usage(Record) */
    0x09, 0xB4,        /* Usage(Rewind) */
    0x09, 0xB3,        /* Usage(Fast Forward) */
    0x75, 0x01,        /* Report Size(0x1) */
    0x95, 0x08,        /* Report Count(0x8) */
    0x81, 0x02,        /* Input(Data, Variable, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0x09, 0x00,        /* Usage(Undefined) */
    0x75, 0x08,        /* Report Size(0x8) */
    0x95, 0x06,        /* Report Count(0x6) */
    0x81, 0x02,        /* Input(Data, Variable, Absolute, No Wrap, Linear, Preferred State, No Null Position, Bit Field) */
    0x09, 0x00,        /* Usage(Undefined) */
    0x75, 0x08,        /* Report Size(0x8) */
    0x95, 0x08,        /* Report Count(0x8) */
    0x91, 0x00,        /* Output(Data, Array, Absolute, No Wrap, Linear, Preferred State, No Null Position, Non VolatileBit Field) */ 
    0xC0               /* End Collection */ 
};
#endif
#define HID_KEYBOARD_REPORT_DESC_SIZE_20 \
    sizeof(gu8KeyboardReportDesc_20) / sizeof(gu8KeyboardReportDesc_20[0])
const uint32_t gu32KeyboardReportDescSize_20 = HID_KEYBOARD_REPORT_DESC_SIZE_20;
#define HID_REPORT_DESCRIPTOR_SIZE_20   HID_KEYBOARD_REPORT_DESC_SIZE_20
#endif

/*!<USB Device Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8DeviceDescriptor[] = {
#else
uint8_t gu8DeviceDescriptor[] __attribute__((aligned(4))) = {
#endif
    LEN_DEVICE,         /* bLength */
    DESC_DEVICE,        /* bDescriptorType */
    0x00, 0x02,         /* bcdUSB */
    0x00,               /* bDeviceClass */
    0x00,               /* bDeviceSubClass */
    0x00,                 /* bDeviceProtocol */
    CEP_MAX_PKT_SIZE,    /* bMaxPacketSize0 */
    /* idVendor */
    USBD_VID20 & 0x00FF,
    (USBD_VID20 & 0xFF00) >> 8,
    /* idProduct */
    USBD_PID20 & 0x00FF,
    (USBD_PID20 & 0xFF00) >> 8,
    0x00, 0x00,         /* bcdDevice */
    0x01,               /* iManufacture */
    0x02,               /* iProduct */
    0x00,               /* iSerialNumber - no serial */
    0x01                /* bNumConfigurations */
};

/*!<USB Qualifier Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8QualifierDescriptor[] = {
#else
uint8_t gu8QualifierDescriptor[] __attribute__((aligned(4))) = {
#endif
    LEN_QUALIFIER,      /* bLength */
    DESC_QUALIFIER,     /* bDescriptorType */
    0x00, 0x02,         /* bcdUSB */
    0x00,               /* bDeviceClass */
    0x00,               /* bDeviceSubClass */
    0x00,               /* bDeviceProtocol */
    CEP_MAX_PKT_SIZE,   /* bMaxPacketSize0 */
    0x01,               /* bNumConfigurations */
    0x00
};

/* USB AUDIO CLASS 2 */
 #ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8ConfigDescriptor[] = {
#else
uint8_t gu8ConfigDescriptor[] __attribute__((aligned(4))) = {
#endif
    /* Configuration Descriptor */
    0x09,               /* Config Descriptor Length */
    0x02,               /* DescriptorType: CONFIG */
#ifdef __BOTH20__
#ifdef __HID20__
    0x7A, 0x01,         /* wTotalLength
                           Descriptor without HID                     (0x161)
                           HID Descriptor                            
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)  
  
                           0x161 + 0x09 + 0x09 + 0x07 = 0x17A
                        */
    0x04,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker), Interface 2 (Microphone), Interface 3 (HID) */
#else
    0x61, 0x01,         /* wTotalLength
                           Configuration Descriptor                      (0x09)    
                           Standard Interface Association Descriptor     (0x08) 
                           Standard AC Interface Descriptor              (0x09)  
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08)                          
                           Microphone - Audio Control                           
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C) 
                           Speaker - Audio Control                            
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)                                
                           Microphone - Interface alternate 0
                             Standard AS interface                       (0x09)
                           Microphone - Interface alternate 1~2
                             Standard AC Interface Descriptor                             (0x09,0x09)
                             Class-Specific AS Interface Descriptor                       (0x10,0x10)
                             Audio Format Type Descriptor                                 (0x06,0x06)
                             Standard AS Isochronous Feedback Endpoint Descriptor         (0x07,0x07)
                             Class-Specific AS Isochronous Audio Data Endpoint Descriptor (0x08,0x08)
                             *Each Interface alternate Summary                            (0x2E,0x2E) 
                           Speaker - Interface alternate 0
                             Standard AS interface                       (0x09)
                           Speaker - Interface alternate 1~2
                             Standard AC Interface Descriptor                             (0x09,0x09)
                             Class-Specific AS Interface Descriptor                       (0x10,0x10)
                             Audio Format Type Descriptor                                 (0x06,0x06)
                             Standard AS Isochronous Feedback Endpoint Descriptor         (0x07,0x07)
                             Class-Specific AS Isochronous Audio Data Endpoint Descriptor (0x08,0x08)
                             AS Isochronous Feedback Endpoint Descriptor                  (0x07,0x07)
                             *Each Interface alternate Summary                            (0x35,0x35) 
                                                        
