OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Audio_Headset/USB/descriptors_20.c
                           0x09 + 0x08 + 0x9 + 0x09 + 0x08 + (0x11 + 0x12 + 0x0C) + (0x11 + 0x12 + 0x0C) + 
                           0x09 + 2 * 0x2E +
                           0x09 + 2 * 0x35 = 0x161
                        */                              
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker), Interface 2 (Microphone) */
#endif  
#elif defined __MIC_ONLY20__
#ifdef __HID20__
    0xD8, 0x00,         /* wTotalLength
                           Descriptor without HID                      (0xBF)
                           HID Descriptor                            
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)  
  
                           0xBF + 0x09 + 0x09 + 0x07 = 0xD8
                        */    
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone), Interface 2 (HID) */
#else
    0xBF, 0x00,         /* wTotalLength
                           Configuration Descriptor                      (0x09)    
                           Standard Interface Association Descriptor     (0x08) 
                           Standard AC Interface Descriptor              (0x09)  
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08) 
                           Microphone - Audio Control                           
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)   
                           Microphone - Interface alternate 0
                             Standard AS interface                       (0x09)
                           Microphone - Interface alternate 1~2
                             Standard AC Interface Descriptor                             (0x09,0x09)
                             Class-Specific AS Interface Descriptor                       (0x10,0x10)
                             Audio Format Type Descriptor                                 (0x06,0x06)
                             Standard AS Isochronous Feedback Endpoint Descriptor         (0x07,0x07)
                             Class-Specific AS Isochronous Audio Data Endpoint Descriptor (0x08,0x08)
                             *Each Interface alternate Summary                            (0x2E,0x2E)                              
                             
                           0x09 + 0x08 + 0x9 + 0x09 + 0x08 + (0x11 + 0x12 + 0x0C) + 
                           0x09 + 2 * 0x2E = 0xBF
                        */                               
    0x02,               /* bNumInterfaces - Interface 0, Interface 1 (Microphone) */
#endif  
#elif defined __SPEAKER_ONLY20__
#ifdef __HID20__
    0xE6, 0x00,         /* wTotalLength
                           Descriptor without HID                      (0xCD)
                           HID Descriptor                            
                             Interface Descriptor                      (0x09)
                             HID Descriptor                            (0x09)
                             Endpoint Descriptor                       (0x07)  
  
                           0xCD + 0x09 + 0x09 + 0x07 = 0xE6
                        */    
    0x03,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker), Interface 2 (HID) */
#else
    0xCD, 0x00,         /* TotalLength
                           Configuration Descriptor                      (0x09)    
                           Standard Interface Association Descriptor     (0x08) 
                           Standard AC Interface Descriptor              (0x09)  
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08) 
                           Speaker - Audio Control                            
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)   
                           Speaker - Interface alternate 0
                             Standard AS interface                       (0x09)
                           Speaker - Interface alternate 1~2
                             Standard AC Interface Descriptor                             (0x09,0x09)
                             Class-Specific AS Interface Descriptor                       (0x10,0x10)
                             Audio Format Type Descriptor                                 (0x06,0x06)
                             Standard AS Isochronous Feedback Endpoint Descriptor         (0x07,0x07)
                             Class-Specific AS Isochronous Audio Data Endpoint Descriptor (0x08,0x08)
                             AS Isochronous Feedback Endpoint Descriptor                  (0x07,0x07)
                           *Each Interface alternate Summary                              (0x35,0x35)                                                      
                             
                           0x09 + 0x08 + 0x9 + 0x09 + 0x08 + + (0x11 + 0x12 + 0x0C) + 
                           0x09 + 2 * 0x35 = 0xCD
                        */                 
    0x02,               /* bNumInterfaces - Interface 0, Interface 1 (Speaker), Interface 2 (HID) */
#endif
#endif
    0x01,               /* bConfigurationValue */
    0x00,               /* iConfiguration */
    0x80,               /* bmAttributes */ 
    0x32,               /* bMaxPower */
    
    /* Standard Interface Association Descriptor */
    0x08,               /* bLength(0x08) */
    0x0B,               /* bDescriptorType(0x0B) */
    0x00,               /* bFirstInterface(0x00) */
#ifdef __BOTH20__    
    0x03,               /* bInterfaceCount(0x03) */
#elif defined __MIC_ONLY20__  || defined __SPEAKER_ONLY20__
    0x02,               /* bInterfaceCount(0x02) */
#endif    
    0x01,               /* bFunctionClass(0x01): AUDIO */
    0x00,               /* bFunctionSubClass(0x00) */
    0x20,               /* bFunctionProtocol(0x2000): 2.0 AF_VERSION_02_00 */
    0x00,               /* iFunction(0x00) */
    
    /* Standard AC Interface Descriptor */
    0x09,               /* bLength */
    0x04,               /* bDescriptorType */
    0x00,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x00,               /* bNumEndpoints */
    0x01,               /* bInterfaceClass:AUDIO */
    0x01,               /* bInterfaceSubClass:AUDIOCONTROL */
    0x20,               /* bInterfaceProtocol */
    0x02,               /* iInterface */
    
    /* Class-Specific AC Interface Header Descriptor */
    0x09,               /* bLength */
    0x24,               /* bDescriptorType:CS_INTERFACE */
    0x01,               /* bDescriptorSubType:HEADER */
    0x00, 0x02,         /* bcdADC:2.0 */
#ifdef __BOTH20__    
    0x08,               /* UAC_FUNCTION_IO_BOX */
    0x6F, 0x00,         /* wTotalLength
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08) 
                           Speaker - Audio Control                            
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)   
                           Microphone - Audio Control                           
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)   
                             
                           0x09 + 0x08 + (0x11 + 0x12 + 0x0C) + (0x11 + 0x12 + 0x0C) = 0x6F
                        */                           
#elif defined __MIC_ONLY20__  
    0x03,               /* MICROPHONE */
    0x40, 0x00,         /* wTotalLength
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08) 
                           Microphone - Audio Control                           
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)   
                             
                           0x09 + 0x08 + (0x11 + 0x12 + 0x0C) = 0x40
                        */    
#elif defined __SPEAKER_ONLY20__  
    0x0A,               /* PRO-AUDIO */
    0x40, 0x00,         /* wTotalLength
                           Class-Specific AC Interface Header Descriptor (0x09)
                           Clock Source Descriptor                       (0x08) 
                           Microphone - Audio Control                           
                             Input Terminal Descriptor                   (0x11)
                             Feature Unit Descriptor                     (0x12)
                             Output Terminal Descriptor                  (0x0C)  
                             
                           0x09 + 0x08 + (0x11 + 0x12 + 0x0C) = 0x40
                        */        
#endif    
    0x00,               /* bmControls(0b00000000) - D1..0: Latency Control */
    
    /* Clock Source Descriptor (bClockID 0x10) */
    0x08,               /* bLength(0x08) */
    0x24,               /* bDescriptorType(0x24): CS_INTERFACE */
    0x0A,               /* bDescriptorSubType(0x0A): CLOCK_SOURCE */
    CLOCK_SOURCE_ID,    /* bClockID(0x10): CLOCK_SOURCE_ID */
    0x07,               /* bmAttributes */
    0x07,               /* bmControls(0x07):
                           clock frequency control: 0b11 - host programmable; 
                           clock validity control: 0b01 - host read only */
    0x00,               /* bAssocTerminal(0x00) */
    0x00,               /* iClockSource */       
    
