OpenNuvoton/NUC505BSP/SampleCode/StdDriver/USBD_Audio_Headset/USB/descriptors_20.c
#ifdef __HID20__
    /* Standard interface 3 alternate 0 */
    0x09,               /* bLength */
    0x04,               /* bDescriptorType */
    0x03,               /* bInterfaceNumber */
    0x00,               /* bAlternateSetting */
    0x01,               /* bNumEndpoints */
    0x03,               /* bInterfaceClass */
    0x00,               /* bInterfaceSubClass */
    0x00,               /* bInterfaceProtocol */
    0x00,               /* iInterface */

    /* HID Descriptor */
    0x09,                                   /* Size of this descriptor in UINT8s. */
    0x21,                                   /* HID descriptor type. */
    0x10, 0x01,                             /* HID Class Spec. release number. */
    0x00,                                   /* H/W target country. */
    0x01,                                   /* Number of HID class descriptors to follow. */
    0x22,                                   /* Dscriptor type. */
    /* Total length of report descriptor */
    sizeof(gu8KeyboardReportDesc_20)&0xff,
    sizeof(gu8KeyboardReportDesc_20)>>8,

     /* Endpoint Descriptor (Interrupt IN Endpoint) */
    0x07,                                   /* bLength */
    0x05,                                   /* bDescriptorType */
    HID_INT_EP_NUM |EP_INPUT,               /* bEndpointAddress */
    0x03,                                   /* bmAttributes */
    EPC_MAX_PKT_SIZE & 0x00FF,
    (EPC_MAX_PKT_SIZE & 0xFF00) >> 8,
    0x28                                    /* bInterval */
#endif
};


/*!<USB Language String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8StringLang[4] = {
#else
uint8_t gu8StringLang[4] __attribute__((aligned(4))) = {
#endif
    4,              /* bLength */
    DESC_STRING,    /* bDescriptorType */
    0x09, 0x04
};

/*!<USB Vendor String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8VendorStringDesc[59] = {
#else
uint8_t gu8VendorStringDesc[59] __attribute__((aligned(4))) = {
#endif
    16,
    DESC_STRING,
    'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

/*!<USB Product String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8ProductStringDesc[] = {
#else
uint8_t gu8ProductStringDesc[] __attribute__((aligned(4))) = {
#endif  
#ifdef __BOTH20__
#ifdef __HID20__
    80,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'H', 0, 'e', 0, 'a', 0, 'd', 0, 's', 0, 'e', 0, 't', 0,      
    ' ', 0,  
    'E', 0, 'a', 0, 'r', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0, 
    ' ', 0, '&', 0, 
    ' ', 0, 'H', 0, 'I', 0, 'D', 0,
#ifdef __KEYBOARD20__
    '-', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0, 'o', 0, 'a', 0, 'r', 0, 'd', 0,
#else
    '-', 0, 'M', 0, 'e', 0, 'd', 0, 'i', 0, 'a', 0, 'k', 0, 'e', 0, 'y', 0,
#endif  
#else
    50,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'H', 0, 'e', 0, 'a', 0, 'd', 0, 's', 0, 'e', 0, 't', 0,      
    ' ', 0,  
    'E', 0, 'a', 0, 'r', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0,   
#endif  
#elif defined __MIC_ONLY20__
#ifdef __HID20__
    68,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'M', 0, 'i', 0, 'c', 0, 'r', 0, 'o', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0,  
    ' ', 0, '&', 0, ' ', 0, 'H', 0, 'I', 0, 'D', 0,
#ifdef __KEYBOARD20__
    '-', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0, 'o', 0, 'a', 0, 'r', 0, 'd', 0,
#else
    '-', 0, 'M', 0, 'e', 0, 'd', 0, 'i', 0, 'a', 0, 'k', 0, 'e', 0, 'y', 0,
#endif      
#else
    38,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'M', 0, 'i', 0, 'c', 0, 'r', 0, 'o', 0, 'p', 0, 'h', 0, 'o', 0, 'n', 0, 'e', 0
#endif  
#elif defined __SPEAKER_ONLY20__
#ifdef __HID20__
    62,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'S', 0, 'p', 0, 'e', 0, 'a', 0, 'k', 0, 'e', 0, 'r', 0,
    ' ', 0, '&', 0,  ' ', 0, 'H', 0, 'I', 0, 'D', 0,    
#ifdef __KEYBOARD20__
    '-', 0, 'K', 0, 'e', 0, 'y', 0, 'b', 0, 'o', 0, 'a', 0, 'r', 0, 'd', 0,
#else
    '-', 0, 'M', 0, 'e', 0, 'd', 0, 'i', 0, 'a', 0, 'k', 0, 'e', 0, 'y', 0,
#endif      
#else
    32,
    DESC_STRING,
    'U', 0, 'A', 0, 'C', 0, ' ', 0, '2', 0, '.', 0, '0', 0, ' ', 0,
    'S', 0, 'p', 0, 'e', 0, 'a', 0, 'k', 0, 'e', 0, 'r', 0
#endif  
#endif  
};
/*!<USB Serial String Descriptor */
#ifdef __ICCARM__
#pragma data_alignment=4
uint8_t gu8StringSerial[] =
#else
uint8_t gu8StringSerial[] __attribute__((aligned(4))) =
#endif
{
    26,             // bLength
    DESC_STRING,    // bDescriptorType
    'A', 0, '0', 0, '2', 0, '0', 0, '1', 0, '6', 0, '0', 0, '8', 0, '9', 0, '0', 0, '0', 0, '0', 0
};
uint8_t *gpu8UsbString[4] = {
    gu8StringLang,
    gu8VendorStringDesc,
    gu8ProductStringDesc,
    gu8StringSerial,
};

uint8_t *gu8UsbHidReport[4] = {
    NULL,
    NULL,
    NULL,
#ifdef __HID20__
    gu8KeyboardReportDesc_20
#else
    NULL
#endif
};
uint32_t gu32UsbHidReportLen[4] = {
    0,
    0,
    0,
#ifdef __HID20__
    sizeof(gu8KeyboardReportDesc_20),
#else
    0
#endif
};

S_USBD_INFO_T gsInfo_20 = {
    gu8DeviceDescriptor,      /*!< Device descriptor */
    gu8ConfigDescriptor,      /*!< Config descriptor */
    gpu8UsbString,            /*!< Pointer for USB String Descriptor pointers */
    gu8QualifierDescriptor,   /*!< Qualifier descriptor */
    gu8ConfigDescriptor,      /*!< Full Speed Config descriptor */
    gu8ConfigDescriptor,      /*!< Other Speed Config descriptor for High Speed */
    gu8ConfigDescriptor,      /*!< Other Speed Config descriptor for Full Speed*/
    NULL,                     /*!< Pointer for HID CompositeDesc descriptor */
    gu8UsbHidReport,          /*!< Pointer for HID Report descriptor */ 
    gu32UsbHidReportLen,      /*!< Pointer for HID Report descriptor Size */   
};


